SM_для_EDT/src/InformationRegisters/рарусЖурналИзмененийНоменклатурыПоАналогам/рарусЖурналИзмененийНоменклатурыПоАналогам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рарусЖурналИзмененийНоменклатурыПоАналогам</name>
  <comment>ФТ.АН.01.27</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>IDДляСтыковки</name>
    <comment>Изменяемый УИД строк, служит для стыковки строк ЗнВП и ЗП (ЗнП). Заполняется регламентным заданием «Обновить строки в ЗнВП»</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>IDНовыйДляСтыковки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИсходнаяНоменклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>ЗапрашиваемаяНоменклатура</name>
    <comment>При выключенной схеме согласования не заполняется</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Номенклатура</name>
    <comment>Номенклатура, на которую заменили оригинал</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПризнакАналог</name>
    <comment>Признак того, что данная замена является заменой на аналог</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаЗамены</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СогласовалОтменилЗамену</name>
    <type>
      <types>String</types>
      <types>CatalogRef.Пользователи</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КомментарийСогласующего</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусСогласования</name>
    <type>
      <types>EnumRef.рарусСтатусыСогласованияАналогов</types>
    </type>
  </resources>
  <resources>
    <name>СогласованиеВключено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДроблениеПрошло</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаДробленияСтрок</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СогласованиеПрошло</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаСогласования</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>РезультатСогласованияВозвращен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаВозвратаРезультатаСогласования</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>РезультатЗаменыЗафиксированВАналогах</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаФормированияЗаписиВАналогах</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПерехватаЗаявки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоОтменаСтроки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <comment>УИД документа</comment>
    <type>
      <types>DocumentRef.впЗаявкаНаСнабжение</types>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаявкаНаТМЦ</name>
    <type>
      <types>DocumentRef.впЗаявкаНаСнабжение</types>
    </type>
  </dimensions>
  <dimensions>
    <name>IDПервоначальнойСтрокиЗнВП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>IDСтрокиЗП_ЗнП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SM_для_EDT/src/Enums/рарусВидыПотребностиЗаявкиНаСнабжение/рарусВидыПотребностиЗаявкиНаСнабжение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рарусВидыПотребностиЗаявкиНаСнабжение</name>
  <comment>rarus PleA ФТ.СНБ.01.01</comment>
  <enumValues>
    <name>ТМЦ</name>
  </enumValues>
  <enumValues>
    <name>Услуги</name>
  </enumValues>
  <enumValues>
    <name>ТМЦЗаСчетСобственныхСредств</name>
  </enumValues>
  <enumValues>
    <name>ПродуктыПитания</name>
  </enumValues>
  <enumValues>
    <name>НавигационныеКарты</name>
  </enumValues>
</mdclass:Enum>

SM_для_EDT/src/Enums/рарусСтатусыСогласованияАналогов/рарусСтатусыСогласованияАналогов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рарусСтатусыСогласованияАналогов</name>
  <enumValues>
    <name>Согласовать</name>
  </enumValues>
  <enumValues>
    <name>Отклонить</name>
  </enumValues>
  <enumValues>
    <name>ОтправитьНаСудно</name>
  </enumValues>
</mdclass:Enum>

SM_для_EDT/src/Documents/впЗаявкаНаСнабжение/впЗаявкаНаСнабжение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>впЗаявкаНаСнабжение</name>
  <registerRecords>AccumulationRegister.рарусТоварыЗаявокНаСнабжение</registerRecords>
  <registerRecords>InformationRegister.впЗаявкиНаСнабжение</registerRecords>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.vftСуда</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>IDремонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПотребности</name>
    <type>
      <types>EnumRef.рарусВидыПотребностиЗаявкиНаСнабжение</types>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемаяДатаПоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбластьРедактирования</name>
    <type>
      <types>EnumRef.рарусОбластиРедактирования</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйКодСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСудовойЗаявки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСогласования</name>
    <type>
      <types>EnumRef.рарусСтатусыСогласованияЗаявкиНаСнабжение</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйБереговойСлужбы</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбластьСоздания</name>
    <type>
      <types>EnumRef.рарусОбластиРедактирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрацииСудовойЗаявки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>БереговаяСлужба</name>
    <comment>makole РАIT-0023340</comment>
    <type>
      <types>CatalogRef.рарусБереговыеСлужбы</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияЗаявки</name>
    <comment>makole РАIT-0023340</comment>
    <type>
      <types>EnumRef.рарусКатегорииЗаявокНаСнабжение</types>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <comment>makole РАIT-0023340</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЖелаемаяДатаОтгрузки</name>
    <comment>makole РАIT-0023340</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсторияИзмененияВерсий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СогласованиеАналоговНеЗавершено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>МатериалыИРаботы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтгрузки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОбеспечения</name>
      <type>
        <types>EnumRef.ВариантыОбеспечения</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.рарусСостоянияЗаявокНаСнабжение</types>
      </type>
    </attributes>
    <attributes>
      <name>Доработать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаДоработки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналог</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураПоставщика</name>
      <type>
        <types>CatalogRef.рарусНоменклатураПоставщиков</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторФайлов</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ВерсияСтроки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВерсияСтрокиЗаблокирована</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсходнаяНоменклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗапрашиваемаяНоменклатура</name>
      <comment>ФТ.АН.01.05</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакАналог</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаЗамены</name>
      <comment>ФТ.АН.01.05</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийСогласующего</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусСогласования</name>
      <type>
        <types>EnumRef.рарусСтатусыСогласованияАналогов</types>
      </type>
    </attributes>
    <attributes>
      <name>IDПервоначальный</name>
      <comment>ФТ.АН.01.05</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IDДинамический</name>
      <comment>ФТ.АН.01.05</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.впЗаявкаНаРемонт</types>
        <types>DocumentRef.впПланГрафикРемонта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПрисоединенныеФайлыСтрок</name>
    <attributes>
      <name>ИдентификаторФайлов</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Файл</name>
      <type>
        <types>CatalogRef.впЗаявкаНаСнабжениеПрисоединенныеФайлы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SM_для_EDT/src/CommonModules/рарусУчетАналогов/Module.bsl
//ПАН+ 
Процедура УстановитьНаФормеЗначенияОбщихРеквизитовУчетаАналогов(Форма) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма,"Объект") Тогда
		Если ТипЗнч(Форма.Объект.Ссылка) = ТИП("ДокументСсылка.впЗаявкаНаСнабжение") Тогда
			ВидТМЦ = (Форма.Объект.ВидПотребности = Перечисления.рарусВидыПотребностиЗаявкиНаСнабжение.ТМЦ);
		Иначе
			ВидТМЦ = Истина;
		КонецЕсли;
	Иначе
		ВидТМЦ  = Истина;
	КонецЕсли;
	
	Форма.ВключенаСхемаАналогов                 = ВидТМЦ И ПолучитьФункциональнуюОпцию("рарусВключенаСхемаАналогов");
	Форма.ИспользуетсяСхемаСогласованияАналогов = ВидТМЦ И ПолучитьФункциональнуюОпцию("рарусИспользуетсяСхемаСогласованияПоАналогам");
	Форма.ИспользуетсяЦелеваяСхемаУчетаАналогов = ВидТМЦ И ПолучитьФункциональнуюОпцию("рарусИспользуетсяЦелеваяСхемаАналогов");

КонецПроцедуры

//вызывается в ПередЗаписью модуля объектов, в ТЧ которых необходимо заполнять ID 
Процедура УстановитьIDВСтрокахТабличнойЧасти(Объект, ИмяТабличнойЧасти = "Товары", ИмяРеквизитаТЧ = "ID") Экспорт
	ТЧ = Объект[ИмяТабличнойЧасти];
	СтрокиБезID = ТЧ.НайтиСтроки(Новый Структура(ИмяРеквизитаТЧ, ""));
	Если СтрокиБезID.Количество() > 0 Тогда			
		Для Каждого СтрокаТовары Из СтрокиБезID Цикл 		
			ID = Строка(Новый УникальныйИдентификатор);
			СтрокаТовары[ИмяРеквизитаТЧ] = ID;		
		КонецЦикла;		
	КонецЕсли;
КонецПроцедуры

Процедура ОчисткаУстановкаРеквизитовУчетаАналоговПриКопировании(Объект) Экспорт
	
	Если НЕ ПолучитьФункциональнуюОпцию("рарусВключенаСхемаАналогов") Тогда
		Возврат;	
	КонецЕсли;
	
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.впЗаявкаНаСнабжение") 
							И Объект.ВидПотребности = Перечисления.рарусВидыПотребностиЗаявкиНаСнабжение.ТМЦ Тогда
									
		СогласованиеВключено = ПолучитьФункциональнуюОпцию("рарусИспользуетсяСхемаСогласованияПоАналогам");
		
		Если СогласованиеВключено Тогда
			Объект.СогласованиеАналоговНеЗавершено = Ложь;
			Объект.Комментарий = "";
		КонецЕсли;
		
		ТЧ = Объект.МатериалыИРаботы;
		Для Каждого Стр ИЗ ТЧ Цикл
			Если СогласованиеВключено Тогда
				Стр.СтатусСогласования = Неопределено;
				Стр.КомментарийСогласующего = "";
				Стр.ЗапрашиваемаяНоменклатура = Неопределено;
			КонецЕсли;
			
			Стр.ПризнакАналог = Ложь;
			Стр.ИсходнаяНоменклатура = Неопределено;
			Стр.ПричинаЗамены = "";		
			Стр.ID = Строка(Новый УникальныйИдентификатор);
			Стр.IDПервоначальный = Строка(Новый УникальныйИдентификатор);
			Стр.IDДинамический = Стр.IDПервоначальный;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры


Процедура ОбновитьЗаписиРегистраЖурналИзмененийНоменклатурыПоАналогам(ДокументОбъект) Экспорт
		
	Если Не ПолучитьФункциональнуюОпцию("рарусИспользуетсяСхемаСогласованияПоАналогам") Тогда
		Возврат;	
	КонецЕсли;

	Если ДокументОбъект.СогласованиеАналоговНеЗавершено Тогда
		Возврат;	
	КонецЕсли;
	
	ОбновитьЖурналИзмененийПоАналогам = Неопределено;
	ДокументОбъект.ДополнительныеСвойства.Свойство("ОбновитьЖурналИзмененийПоАналогам", ОбновитьЖурналИзмененийПоАналогам);
	Если ОбновитьЖурналИзмененийПоАналогам = Неопределено Тогда
		Возврат;		
	КонецЕсли;
	
	#Если НЕ Клиент И НЕ Сервер И НЕ ВнешнееСоединение Тогда
		ДокументОбъект = Документы.впЗаявкаНаСнабжение.СоздатьДокумент();
		Стр = ДокументОбъект.МатериалыИРаботы.Добавить();
	#КонецЕсли
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	рарусЖурналИзмененийНоменклатурыПоАналогам.Период КАК Период,
	|	рарусЖурналИзмененийНоменклатурыПоАналогам.Документ КАК Документ,
	|	рарусЖурналИзмененийНоменклатурыПоАналогам.ЗаявкаНаТМЦ КАК ЗаявкаНаТМЦ,
	|	рарусЖурналИзмененийНоменклатурыПоАналогам.IDПервоначальнойСтрокиЗнВП КАК IDПервоначальнойСтрокиЗнВП,
	|	рарусЖурналИзмененийНоменклатурыПоАналогам.IDСтрокиЗП_ЗнП КАК IDСтрокиЗП_ЗнП,
	|	рарусЖурналИзмененийНоменклатурыПоАналогам.IDНовыйДляСтыковки КАК IDНовыйДляСтыковки
	|ИЗ
	|	РегистрСведений.рарусЖурналИзмененийНоменклатурыПоАналогам КАК рарусЖурналИзмененийНоменклатурыПоАналогам
	|ГДЕ
	|	рарусЖурналИзмененийНоменклатурыПоАналогам.СтатусСогласования = &СтатусСогласования
	|	И рарусЖурналИзмененийНоменклатурыПоАналогам.ЗаявкаНаТМЦ = &ЗаявкаНаТМЦ";
	
	Запрос.УстановитьПараметр("СтатусСогласования", Перечисления.рарусСтатусыСогласованияАналогов.ОтправитьНаСудно);
	Запрос.УстановитьПараметр("ЗаявкаНаТМЦ", ДокументОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		РегистрИзмененийНоменклатуры = РегистрыСведений.рарусЖурналИзмененийНоменклатурыПоАналогам.СоздатьНаборЗаписей(); 
		РегистрИзмененийНоменклатуры.Отбор.Период.Установить(ВыборкаДетальныеЗаписи.Период);
		РегистрИзмененийНоменклатуры.Отбор.Документ.Установить(ВыборкаДетальныеЗаписи.Документ);
		РегистрИзмененийНоменклатуры.Отбор.ЗаявкаНаТМЦ.Установить(ВыборкаДетальныеЗаписи.ЗаявкаНаТМЦ);
		РегистрИзмененийНоменклатуры.Отбор.IDПервоначальнойСтрокиЗнВП.Установить(ВыборкаДетальныеЗаписи.IDПервоначальнойСтрокиЗнВП);
		РегистрИзмененийНоменклатуры.Отбор.IDСтрокиЗП_ЗнП.Установить(ВыборкаДетальныеЗаписи.IDСтрокиЗП_ЗнП);
		РегистрИзмененийНоменклатуры.Прочитать();
		ТекДата = ТекущаяДата();
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("IDПервоначальный", ВыборкаДетальныеЗаписи.IDПервоначальнойСтрокиЗнВП);
		ПараметрыОтбора.Вставить("IDДинамический", ВыборкаДетальныеЗаписи.IDНовыйДляСтыковки);
		НайденныеСтроки = ДокументОбъект.МатериалыИРаботы.НайтиСтроки(ПараметрыОтбора);

		Если НайденныеСтроки.Количество() Тогда
			Стр = НайденныеСтроки[0];
			Для Каждого стрНабора из РегистрИзмененийНоменклатуры Цикл
				стрНабора.СтатусСогласования  = Стр.СтатусСогласования;
				стрНабора.ДатаСогласования = ТекДата;
				стрНабора.СогласовалОтменилЗамену = "Экипаж";
				стрНабора.СогласованиеПрошло = Истина;
				стрНабора.КомментарийСогласующего = Стр.КомментарийСогласующего;
			КонецЦикла;
		
			Если РегистрИзмененийНоменклатуры.Количество() Тогда
				РегистрИзмененийНоменклатуры.Записать();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ОбновитьСтрокиДокументаПоСтатусамСогласованияАналогов(ДокументОбъект) Экспорт
	
	#Если НЕ Клиент И НЕ Сервер И НЕ ВнешнееСоединение Тогда
		ДокументОбъект = Документы.впЗаявкаНаСнабжение.СоздатьДокумент();
		Стр = ДокументОбъект.МатериалыИРаботы.Добавить();
	#КонецЕсли
	
	Если ДокументОбъект.СогласованиеАналоговНеЗавершено Тогда
		Возврат;	
	КонецЕсли;
	
	ОбновитьЖурналИзмененийПоАналогам = Неопределено;
	ДокументОбъект.ДополнительныеСвойства.Свойство("ОбновитьЖурналИзмененийПоАналогам", ОбновитьЖурналИзмененийПоАналогам);
	Если ОбновитьЖурналИзмененийПоАналогам = Неопределено Тогда
		Возврат;		
	КонецЕсли;
	
	МассивСтрокКомментария = Новый Массив;	
	ТекстПоСтатусу = "";
	СтрокаКомментария = "";
	Для Каждого Стр ИЗ ДокументОбъект.МатериалыИРаботы Цикл
		Если Стр.СтатусСогласования = Перечисления.рарусСтатусыСогласованияАналогов.Согласовать Тогда
			ТекстПоСтатусу = " %1 Стр №%2: Согласована замена %3 на %4 %5";
			СтрокаКомментария = СтрШаблон(ТекстПоСтатусу,
								ТекущаяДата(),
								Стр.НомерСтроки,
								Стр.Номенклатура,
								Стр.ЗапрашиваемаяНоменклатура,
								?(ПустаяСтрока(Стр.КомментарийСогласующего)," "," (" + Стр.КомментарийСогласующего + ")"));
			МассивСтрокКомментария.Добавить(СтрокаКомментария);
			
			Стр.Номенклатура = Стр.ЗапрашиваемаяНоменклатура;
			Стр.ЗапрашиваемаяНоменклатура = Справочники.Номенклатура.ПустаяСсылка();
			Стр.СтатусСогласования = Перечисления.рарусСтатусыСогласованияАналогов.ПустаяСсылка();
			Стр.КомментарийСогласующего = "";
		ИначеЕсли Стр.СтатусСогласования = Перечисления.рарусСтатусыСогласованияАналогов.Отклонить Тогда
			ТекстПоСтатусу = " %1 Стр №%2: Отклонена замена %3 на %4 %5";
			СтрокаКомментария = СтрШаблон(ТекстПоСтатусу,
								ТекущаяДата(),
								Стр.НомерСтроки,
								Стр.Номенклатура,
								Стр.ЗапрашиваемаяНоменклатура,
								?(ПустаяСтрока(Стр.КомментарийСогласующего)," "," (" + Стр.КомментарийСогласующего + ")"));
			МассивСтрокКомментария.Добавить(СтрокаКомментария);
			
			Стр.ЗапрашиваемаяНоменклатура = Справочники.Номенклатура.ПустаяСсылка();
			Стр.СтатусСогласования = Перечисления.рарусСтатусыСогласованияАналогов.ПустаяСсылка();
			Стр.ПричинаЗамены = "";
	        Стр.ПризнакАналог = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	СтрокаКомментария = "";
	Если МассивСтрокКомментария.Количество() Тогда
		Для Каждого Коммент ИЗ МассивСтрокКомментария Цикл
			СтрокаКомментария = СтрокаКомментария + Коммент + Символы.ПС;		
		КонецЦикла;
		Если НЕ ПустаяСтрока(СтрокаКомментария) Тогда
			ДокументОбъект.Комментарий = ДокументОбъект.Комментарий + Символы.ПС + СтрокаКомментария;	
		КонецЕсли;
	КонецЕсли;
	 
КонецПроцедуры

Функция ОтборСтрокПоСтатусуСогласованияАналогов(Объект, Статус) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("рарусИспользуетсяСхемаСогласованияПоАналогам") Тогда
		Возврат Новый Массив;	
	КонецЕсли;
	
	Если ТипЗнч(Объект) <> ТИП("ДокументСсылка.впЗаявкаНаСнабжение") 
			И ТипЗнч(Объект) <> ТИП("ДокументОбъект.впЗаявкаНаСнабжение") Тогда
		Возврат Новый Массив;	
	КонецЕсли;

	ОтборСтрок = Новый Структура;
	ОтборСтрок.Вставить("СтатусСогласования",Статус);
	СтрокиОтбор = Объект.МатериалыИРаботы.НайтиСтроки(ОтборСтрок);
	
	Возврат СтрокиОтбор;
	
КонецФункции
//ПАН-
